Repository: jithin484/boilerplate-peewee-flask
Catalog: application/translations/*/LC_MESSAGES/messages.po
Languages: he

source: News Item "{}" was updated.
he: ידיעה "{}" עודכנה.

source: News item "{}" was deleted.
he: ידיעה "{}" נמחקה.

source: Home
he: בית

source: Members
he: מנויים

source: Logout
he: התנתקות

source: Change password
he: שינוי סיסמה

source: Site editor
he: עריכת האתר

source: User admin
he: ניהול משתמשים

source: Login
he: התחברות

source: You can't remove your own admin role.
he: אין באפשרותך לבטל את תפקיד הניהול של עצמך.

source: Password should be at least 10 characters long.
he: הסיסמה צריכה להיות באורך 10 תווים לפחות.

source: Passwords didn't match.
he: הסיסמאות לא היו זהות.

source: You can't deactivate yourself.
he: אין באפשרותך להקפיא את החשבון של עצמך.

source: User {} was updated.
he: החשבון {} עודכן

source: You can't delete your own user.
he: אין באפשרותך למחוק את החשבון של עצמך.

source: User {} was deleted.
he: החשבון {} נמחק

source: I know what I'm doing.
he: אני עושה זאת בדעה צלולה.

source: You have to know what you're doing.
he: יש לעשות זאת בדעה צלולה.

source: Delete
he: מחיקה

source: Register
he: הרשמה

source: Forgot password
he: שכחתי סיסמה

source: Confirm account
he: אישור כתובת דואר

source: Send password reset instructions
he: שליחת קישור לאיתחול סיסמה בדואר

source: Sign up
he: הרשמה

source: Resend confirmation instructions
he: שליחת קישור לאימות כתובת דואר

source: Edit user
he: עריכת חשבון

source: Create a user
he: יצירת חשבון

source: Roles
he: תפקידים

source: Update
he: עדכון

source: Newer items
he: ידיעות חדשות יותר

source: Older items
he: ידיעות ישנות יותר

source: What's new?
he: מה חדש?

source: Nothing new
he: שום דבר חדש

source: Member area
he: איזור לחברים בלבד

source: Stuff here is exclusive.
he: המידעים כאן הם בלעדיים בלבד.

source: Nothing special
he: שום דבר מיוחד

source: Edit
he: עריכת

source: Create a news item
he: יצירת ידיעה חדשה

source: Delete news item
he: מחיקת ידיעה
